suhetao/stm32f4_mpu9250/Application/Include/stm32f4_mpu9250.h
/*
The MIT License (MIT)

Copyright (c) 2015-? suhetao

Permission is hereby granted, free of charge, to any person obtaining a copy of
this software and associated documentation files (the "Software"), to deal in
the Software without restriction, including without limitation the rights to
use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of
the Software, and to permit persons to whom the Software is furnished to do so,
subject to the following conditions:

The above copyright notice and this permission notice shall be included in all
copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS
FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR
COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER
IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
*/

#ifndef _STM32F4_MPU9250_H
#define _STM32F4_MPU9250_H

#include "stm32f4xx.h"

#define MPU9250_SPIx                       SPI2
#define MPU9250_SPIx_CLK                   RCC_APB1Periph_SPI2

#define MPU9250_SPIx_CS_PIN                GPIO_Pin_12                 /* PB.12 */
#define MPU9250_SPIx_CS_GPIO_PORT          GPIOB                       /* GPIOB */
#define MPU9250_SPIx_CS_GPIO_CLK           RCC_AHB1Periph_GPIOB

#define MPU9250_SPIx_SCK_PIN               GPIO_Pin_13                 /* PB.13 */
#define MPU9250_SPIx_SCK_GPIO_PORT         GPIOB                       /* GPIOB */
#define MPU9250_SPIx_SCK_GPIO_CLK          RCC_AHB1Periph_GPIOB
#define MPU9250_SPIx_SCK_SOURCE            GPIO_PinSource13
#define MPU9250_SPIx_SCK_AF                GPIO_AF_SPI2

#define MPU9250_SPIx_MISO_PIN              GPIO_Pin_14                  /* PB.14 */
#define MPU9250_SPIx_MISO_GPIO_PORT        GPIOB                       /* GPIOB */
#define MPU9250_SPIx_MISO_GPIO_CLK         RCC_AHB1Periph_GPIOB
#define MPU9250_SPIx_MISO_SOURCE           GPIO_PinSource14
#define MPU9250_SPIx_MISO_AF               GPIO_AF_SPI2

#define MPU9250_SPIx_MOSI_PIN              GPIO_Pin_15                  /* PB.15 */
#define MPU9250_SPIx_MOSI_GPIO_PORT        GPIOB                       /* GPIOB */
#define MPU9250_SPIx_MOSI_GPIO_CLK         RCC_AHB1Periph_GPIOB
#define MPU9250_SPIx_MOSI_SOURCE           GPIO_PinSource15
#define MPU9250_SPIx_MOSI_AF               GPIO_AF_SPI2

#define MPU9250_Select() GPIO_ResetBits(MPU9250_SPIx_CS_GPIO_PORT, MPU9250_SPIx_CS_PIN)
#define MPU9250_Deselect() GPIO_SetBits(MPU9250_SPIx_CS_GPIO_PORT, MPU9250_SPIx_CS_PIN)

#define MPU9250_SPIx_GPIO_CLK_INIT         RCC_AHB1PeriphClockCmd
#define MPU9250_SPIx_CLK_INIT              RCC_APB1PeriphClockCmd
#define MPU9250_SPIx_IRQn                  SPI2_IRQn
#define MPU9250_SPIx_IRQHandler            SPI2_IRQHandler

#define MPU9250_I2C_MST_CTRL            0x24
#define MPU9250_I2C_SLV0_ADDR           0x25
#define MPU9250_I2C_SLV0_REG            0x26
#define MPU9250_I2C_SLV0_CTRL           0x27
#define MPU9250_I2C_SLV1_ADDR           0x28
#define MPU9250_I2C_SLV1_REG            0x29
#define MPU9250_I2C_SLV1_CTRL           0x2A
#define MPU9250_I2C_SLV2_ADDR           0x2B
#define MPU9250_I2C_SLV2_REG            0x2C
#define MPU9250_I2C_SLV2_CTRL           0x2D
#define MPU9250_I2C_SLV3_ADDR           0x2E
#define MPU9250_I2C_SLV3_REG            0x2F
#define MPU9250_I2C_SLV3_CTRL           0x30
#define MPU9250_I2C_SLV4_ADDR           0x31
#define MPU9250_I2C_SLV4_REG            0x32
#define MPU9250_I2C_SLV4_DO             0x33
#define MPU9250_I2C_SLV4_CTRL           0x34
#define MPU9250_I2C_SLV4_DI             0x35
#define MPU9250_I2C_MST_STATUS          0x36

#define MPU9250_I2C_SLV4_EN 0x80
#define MPU9250_I2C_SLV4_DONE 0x40
#define MPU9250_I2C_SLV4_NACK 0x10
//
#define MPU9250_I2C_IF_DIS (0x10)
#define MPU9250_I2C_MST_EN (0x20)
#define MPU9250_FIFO_RST (0x04)
#define MPU9250_FIFO_ENABLE (0x40)

#define MPU9250_SPIx_ADDR 0x00
#define MPU9250_I2C_READ 0x80
#define MPU9250_SPIx_BR_CLEAR_MASK 0xFFC7

//low hardware functions
void MPU9250_Init(void);
u8 MPU9250_SPIx_SendByte(u8 data);
void MPU9250_SPIx_SetDivisor(u16 data);

//
u8 MPU9250_SPIx_Read(u8 addr, u8 reg_addr);
int MPU9250_SPIx_Reads(u8 addr, u8 reg_addr, u8 len, u8* data);
int MPU9250_SPIx_Write(u8 addr, u8 reg_addr, u8 data);
int MPU9250_SPIx_Writes(u8 addr, u8 reg_addr, u8 len, u8* data);

//global function use for eMPL
int MPU9250_AK8963_SPIx_Read(u8 akm_addr, u8 reg_addr, u8* data);
int MPU9250_AK8963_SPIx_Reads(u8 akm_addr, u8 reg_addr, u8 len, u8* data);
int MPU9250_AK8963_SPIx_Write(u8 akm_addr, u8 reg_addr, u8 data);
int MPU9250_AK8963_SPIx_Writes(u8 akm_addr, u8 reg_addr, u8 len, u8* data);

#endif
